{
  "header": {
    "jobTitle": "Sofware Developer",
    "name": "Eros Daniel Zamora"
  },
  "about": {
    "title": "SOBRE MÍ",
    "paragraph1": "I am a software developer with a solid technical background and experience in creating applications and technological solutions. I am passionate about learning new technologies and contributing in a collaborative environment, always seeking to improve my skills and offer efficient solutions.",
    "paragraph2": "I have experience in web application development, as well as in implementing customized solutions for clients. I stand out for my ability to solve complex problems and my attention to detail.",
    "paragraph3": "I consider myself a proactive person with effective communication skills and a strong commitment to quality work. I am always willing to learn and adapt to new technologies and work methodologies.",
    "paragraph4": "Ready to take on new challenges and contribute to innovative projects!",
    "showMore": "Show More",
    "showLess": "Show Less"
  },
  "skills": {
    "title": "Skills",
    "goodPractices": "Good Practices",
    "databases": "Databases",
    "toolsVersionControl": "Tools Version Control",
    "methodologies": "Metodologhies",
    "conceptsArchitecture": "Concepts Architecture",
    "platformsERP": "Plataforms / ERP",
    "languagesSpoken": "Languages",
    "downloadTitle": "Download my Curriculum Vitae"
  },
  "education": {
    "title": "Education",
    "institutions": [
      {
        "institution": "Cristo Rey Educational Institute",
        "backgroundText": "Collegue",
        "alignment": "left",
        "details": [
        "Humanities and Social Sciences",
        "Year of graduation: 2016"
        ]
      },
      {
        "institution": "University of La Punta, San Luis",
        "backgroundText": "University",
        "alignment": "right",
        "details": [
          "University Technical Degree in Software Development",
          "Start year: 2018",
          "Status: In progress"
        ]
      }
    ]
  },
  "experience": {
    "title": "Experience",
    "jobs": [
      {
        "company": "Axxon Consulting",
        "position": "Software Developer",
        "duration": "Jul 2023 - Feb 2025",
        "logo": "/images/axxon.png",
        "responsibilities": [
          "Solution Developer on Dynamics 365 FO (ERP). X++ for functionality development (forms, tables, entities). I worked with SQL Server for queries and reports. I implemented queries with insert recordset and different types of joins in X++ to extract data from sales transactions and organizational hierarchies. Reduction of errors in advance billing and optimization of expense recording in projects. Resolved performance issues such as SQLExecution Timeout by optimizing filters, join conditions, and report pagination. Contributed to the customization of financial/operational modules, ensuring that billing and customer data loading processes were more efficient.",
          "asdofkosadf"
        ]
      }
    ]
  },
  "projects": {
    "title": "Featured Projects",
    "allProjects": [
        {
          "title": "Event Organizer",
          "description": "University personal development for an event organizer with ABM for contacts, clients, and events.",
          "image": "/images/agenda.png",
          "technologies": ["C#"]
        },
        {
          "title": "Static Website",
          "description": "Personal university development of a static website using HTML, CSS, and JavaScript.",
          "image": "/images/ulp.png",
          "technologies": ["HTML5", "CSS3", "JavaScript"]
        },

        {
          "title": "Axxon Consulting",
          "description": "I participated in the development of customizations in Dynamics 365 Finance and Operations using X++. I implemented custom entities, forms, tables, and fields for billing and project management processes. Creation and optimization of queries in SQL Server for internal reports. I collaborated with multidisciplinary teams to improve operational flows for clients in different sectors.",
          "image": "/images/axxon.png",
          "technologies": ["X++", "SQL Server", "Dynamics 365", "Git"]
        },
        {
          "title": "Student manager",
          "description": "Development in .NET Core + EF Core + SQL Server, under Clean Architecture. Application of SOLID principles and dependency injection. Implementation of complete CRUD for students. (Pending) Unit testing with xUnit.",
          "image": "/images/studentsmanager.png",
          "link": "https://github.com/Eros23z/Student-Management-.Net",
          "technologies": ["C#", ".NET", "EF Core", "SQL Server", "Git", "Clean architecture", "SOLID principles", "dependency injection"]
        },
        {
          "title": "Trombosis y trombofilia Argentina",
          "description": "Development and optimization of an interactive contact module, incorporating form validation (HTML5) and anti-spam protection with Google reCAPTCHA v2. Formsubmit.co was integrated as a backendless service for efficient email management, overcoming challenges in configuring redirects and excluding sensitive data from emails.",
          "image": "/images/ong.png",
          "technologies": ["HTML5", "CSS3", "JavaScript", "Bootstrap", "Git"],
          "link": "https://trombofiliaytrombosisargentina.netlify.app/"
        },
        {
          "title": "Curriculum Vitae Web",
          "description": "Development of my own interactive and dynamic resume, built from scratch. This project showcases my skills in front-end development, UI/UX design, and performance optimization. It features smooth navigation, scroll animations, and a modern, responsive design.",
          "image": "/images/cv.png",
          "technologies": ["HTML5", "CSS3", "JavaScript", "React.js", "Git"]
        }
    ],
    "viewProject": "See project"
  },
  "navbar": {
    "home": "Home",
    "about": "About Me",
    "skills": "Skills",
    "education": "Education",
    "experience": "Experiencie",
    "projects": "Projects",
    "toggleThemeLight": "Light Mode",
    "toggleThemeDark": "Dark Mode",
    "toggleLangEnglish": "English",
    "toggleLangSpanish": "Spanish"
  },
  "chatbot": {
    "title": "Virtual Assistant",
    "presentation": "Hello! I am the Eros chatbot. Do you have any questions about my resume?",
    "help": "You can ask about: 'Experience', 'Projects', 'Skills', 'Contact', 'Technologies', 'Future', etc.",
    "write": "Please write your question below...",

    "experience": "I have two years of experience as a software developer, specializing in React and C# .NET.",
    "projects": "I have worked on notable projects such as developing a website for an NGO, developing my online resume, CRUD with .NET, etc. You can see them in the ‘Projects’ section of my resume.",
    "skills": "My main skills are React.js, C#/.NET, and SQL Server. I also have knowledge of Node.js, Express, and agile methodologies.",
    "salary": "I prefer to discuss salary during the interview so that I can better understand the responsibilities of the position.",
    "contact": "You can contact me via LinkedIn, GitHub, or email. You will find the links at the top of the page.",
    "technologies": "My main technology stack includes React.js, C#/.NET, SQL Server, Node.js, and Express. I have also worked with TypeScript and databases such as MongoDB and MySQL.",
    "github": "You can view my code and projects on my GitHub profile. The link is at the top of the page.",
    "why": "I am passionate about solving problems and creating software products. I am a proactive and results-oriented person.",
    "future": "I am looking for a position that will allow me to grow professionally and continue learning from a team of experts. My goal is to apply my skills to create innovative and scalable software solutions, contributing significantly to the success of the company.",
    "hi": "Hello! Welcome to my interactive resume. Do you have any questions about my experience, projects, or skills?",
    "bye": "Goodbye! Thank you for your interest. I hope to speak with you soon.",
    "thanks": "You're welcome. Is there anything else I can help you with?",
    "default": "I'm sorry, I didn't understand your question. You can try asking about 'experience', 'projects', 'skills', 'contact' or 'technologies'."
  },
  "footer": {
    "allRightsReserved": "Eros Daniel Zamora. All rights reserved.",
    "builtWithLove": "Designed and developed with passion."
  }
}